v2206/MSc_icedAirfoil/Meshing_ice_1_v2/_05deg/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          1e-5;

writeControl    runTime;	//adjustableRunTime;	//timeStep;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.9;

functions
{
    #includeFunc streamlines

forceCoeffs
{
    type                forceCoeffs;
    functionObjectLibs  ("libforces.so");
    writeControl	runTime;
    writeInterval	0.05;
 
    patches             ("airfoil");
    rho			rhoInf;
    log                 true;
     
    liftDir             (0 1 0);
    dragDir             (1 0 0);
    CofR                (0.25 0 0);	//specify axis
    pitchAxis           (0 0 1);	//specify axis
    magUInf             15;
    rhoInf              1.2;
    lRef                0.987;
    Aref                0.0000987;
}

yPlus
{
    type        	yPlus;
    writeControl	runTime;
    writeInterval	0.05;
    libs        	("libfieldFunctionObjects.so");
}

}

// ************************************************************************* //
