v2206/MSc_icedAirfoil/Meshing_ice_1_v2/_05deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    west
    {
        type            patch;
        nFaces          24;
        startFace       47108;
    }
    east
    {
        type            patch;
        nFaces          24;
        startFace       47132;
    }
    north
    {
        type            patch;
        nFaces          48;
        startFace       47156;
    }
    south
    {
        type            patch;
        nFaces          48;
        startFace       47204;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23524;
        startFace       47252;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23524;
        startFace       70776;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          748;
        startFace       94300;
    }
)

// ************************************************************************* //
